@farodin91 Using the HCL from `sample.tf`:

```tf
# Required for Terraform 0.13 and up (https://www.terraform.io/upgrade-guides/0-13.html)
terraform {
  required_providers {
    artifactory = {
      source  = "registry.terraform.io/jfrog/artifactory"
      version = "6.15.2"
    }
  }
}

provider "artifactory" {
  //  supply ARTIFACTORY_ACCESS_TOKEN / JFROG_ACCESS_TOKEN / ARTIFACTORY_API_KEY and ARTIFACTORY_URL / JFROG_URL as env vars
}

resource "artifactory_local_terraformbackend_repository" "terraformbackend-local" {
  key         = "terraformbackend-local"
  description = "Repo created by Terraform Provider Artifactory"
}
```

I was able to create a TF backend local repo:

```
alexh@alexh-mac terraform-provider-artifactory % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_local_terraformbackend_repository.terraformbackend-local will be created
  + resource "artifactory_local_terraformbackend_repository" "terraformbackend-local" {
      + blacked_out          = false
      + description          = "Repo created by Terraform Provider Artifactory"
      + excludes_pattern     = (known after apply)
      + id                   = (known after apply)
      + includes_pattern     = (known after apply)
      + key                  = "terraformbackend-local"
      + package_type         = (known after apply)
      + priority_resolution  = false
      + project_environments = (known after apply)
      + repo_layout_ref      = "simple-default"
      + xray_index           = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_local_terraformbackend_repository.terraformbackend-local: Creating...
artifactory_local_terraformbackend_repository.terraformbackend-local: Creation complete after 1s [id=terraformbackend-local]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

![Screen Shot 2022-09-23 at 9 08 41 AM](https://user-images.githubusercontent.com/27263/192004959-bfe32c31-b586-499b-ab97-caf3ec215e12.png)

